<?php

$tan_info = [
    '6' => '제 1탄',
    '9' => '제 2탄',
    '10' => '제 3탄',
    '11' => '제 4탄',
    '12' => '레전드 1탄',
    '13' => '레전드 2탄',
    '14' => '레전드 3탄',
    '15' => '레전드 4탄',
    '16' => '러시 1탄',
    '17' => '러시 2탄',
    '18' => '러시 3탄',
    '19' => '러시 4탄',
    '20' => '러시 5탄',
    '21' => '러시 6탄',
];

$seong_info = [
    '1' => "1 성",
    '2' => "2 성",
    '3' => "3 성",
    '4' => "4 성",
    '5' => "5 성",
    '7' => "행운",
];

$acquisition_method_list = [
    '1' => "몬스터볼",
    '2' => "슈퍼볼",
    '3' => "하이퍼볼",
    '4' => "마스터볼",
    '5' => "교환찬스",
    '6' => "선배찬스",
    '7' => "불기둥",
    '8' => "기타",
];

return [
    'tan' => $tan_info,
    'seong' => $seong_info,
    'acquisition_method_list' => $acquisition_method_list,
];
